Revit 2026 API

# SpacingRule Class

---

A rule for specifying a set of equidistant, parallel gridlines within a region.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBSpacingRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpacingRule : APIObject
```
```vb
Public Class SpacingRule
	Inherits APIObject
```
```cpp
public ref class SpacingRule : public APIObject
```
```fsharp
type SpacingRule =
    class
        inherit APIObject
    end
```

The SpacingRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BeltMeasurement | On a curved surface, BeltMeasurement specifies where the grid's distances are measured. |
|  | Distance | The exact distance between layout lines. |
|  | GridlinesRotation | An additional rotation to be applied to this set of grid lines. |
|  | HasBeltMeasurement | True if the gridlines are not parallel due to surface curvature, and the BeltMeasurement property therefore applies. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Justification | The justification of the lines within the region. |
|  | Layout | A choice of several gridline layout rules. |
|  | Number | The exact number of lines in the region. |
|  | Offset | An additional offset applied to the first gridline. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetLayoutFixedDistance | Set the Layout property to FixedDistance. |
|  | SetLayoutFixedNumber | Set the Layout property to FixedNumber. |
|  | SetLayoutMaximumSpacing | Set the Layout property to MaximumSpacing. |
|  | SetLayoutMinimumSpacing | Set the Layout property to MinimumSpacing. |
|  | SetLayoutNone | Set the Layout property to None. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace